end1 = room{
	nam = 'Конец',
	pic = 'pic1.png',
	dsc = [[Прошло не знаю сколько времени, но здесь действительно очень скучно. 
	Кроме двери и картины ничего нет. Думаю, стоит создать сюда ещё кровать, стол, стул, компьютер, холодильник. 
	Но хотя бы тут безопасно, а необходимое я могу и сама создать.^
	Так проходили месяцы, годы, десятилетия. 
	Думаю, я смогла остановить разрушение мира, но выходить от сюда по-прежнему не хочу. Спокойствие мне важнее. 
	На этом наш путь закончен, лисёнок. Успехов тебе.
	]];
	obj = {vway('Конец','{The end}', 'info')},
}

end2 = room{
	nam = 'Конец',
	pic = 'end2.png',
	dsc = [["Но в великой этой драме я со всеми наравне^
тоже, в сущности, играю роль, доставшуюся мне.^
Даже если где-то с краю перед камерой стою,^
даже тем, что не играю, я играю роль свою.^
И, участвуя в сюжете, я смотрю со стороны,^
как текут мои мгновенья, мои годы, мои сны,^
как сплетается с другими эта тоненькая нить,^
где уже мне, к сожаленью, ничего не изменить,^
потому что в этой драме, будь ты шут или король,^
дважды роли не играют, только раз играют роль.^
И над собственною ролью плачу я и хохочу.^
То, что вижу, с тем, что видел, я в одно сложить хочу.^
То, что видел, с тем, что знаю, помоги связать в одно,^
жизнь моя, кинематограф, черно-белое кино!"^
	Выйдя на улицу, я обнаружила, что всё вернулось на свои места.
	 А это значит, что я не зря проделала с тобой этот путь.
	 Но уже никогда не будет как прежде. Казалось, что машины летают как раньше,
	 что люди спешат по-прежнему. 
	 Но я с тобой знаю, что наш мир выучил новый важный урок. Всё должно идти своим чередом,
	 человеку рано ещё вмешиваться в течение времени. Давайте, будем менять настоящее, а не прошлое или будущее. ]];
	obj = {vway('Конец','{The end}', 'info')},
}

info = room{
	nam = 'Информация',
	pic = 'i.png',
	dsc = [[Название: The last code^
	Автор идеи: Щерба Полина^
	Автор игры: Щерба Полина^
	Почта для обратной связи: pollyshcherba@gmail.com^
	Для создания было использовано:^
	Отрывок стихотворения из сборника «Кинематограф» Ю. Д. Левитанского «Вступление в книгу»,^
	Цитаты из книг Джин Соул «Девять хвостов бессмертного мастера»,^
	Справочная информация о создании игр на INSTEAD^
	(https://instead-games.ru/wiki/doku.php?id=stead3#stead3) 
]];
	
}
